# Taps
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "buo/cask-upgrade"

# CLI apps
brew "ansible"
brew "python@3.9"
brew "cairo"
brew "espeak"
brew "unbound"
brew "ffmpeg"
brew "fluxcd/tap/flux"
brew "fping"
brew "get_iplayer"
brew "git"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "kubeval"
brew "kustomize"
brew "macvim"
brew "mas"
brew "mutt"
brew "neofetch"
brew "nmap"
brew "nvm"
brew "qrencode"
brew "rename"
brew "restic"
brew "rsync"
brew "starship"
brew "telnet"
brew "terraform"
brew "tmux"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zmap"

# GUI Apps
cask "1password-cli"
cask "airflow"
cask "airfoil"
cask "alfred"
cask "balenaetcher"
cask "calibre"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-chrome-beta"
cask "handbrake"
cask "home-assistant"
cask "imageoptim"
cask "mullvadvpn"
cask "multipass"
cask "raspberry-pi-imager"
cask "remarkable"
cask "send-to-kindle"
cask "visual-studio-code"
cask "iterm2"
cask "slack"
cask "font-fira-mono-nerd-font"

# Mac Store apps
mas "1Password 7", id: 1333542190
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "EasyMQTT", id: 1523099606
mas "iA Writer", id: 775737590
mas "Pixelmator Pro", id: 1289583905
mas "Spark", id: 1176895641
mas "Twitterrific", id: 1289378661
mas "Vinegar", id: 1591303229
mas "Wayback Machine", id: 1472432422
mas "WireGuard", id: 1451685025
mas "Telegram", id: 747648890
mas "Yoink", id: 457622435
